<?xml version="1.0" ?>
<net batch="1" name="semanticsegmentation_ICNet" version="3">
	<layers>
		<layer id="0" name="input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="sub/add_" precision="FP32" type="Power">
			<data power="1" scale="1" shift="0.0"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="ExpandDims" precision="FP32" type="Reshape">
			<data axis="0" dim="1,3,256,512" num_axes="-1"/>
			<input>
				<port id="0">
					<dim>256</dim>
					<dim>512</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_sub2" precision="FP32" type="Interp">
			<data align_corners="1" factor="0.5" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>256</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv1_1_3x3_s2/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="0,0" pads_end="1,1" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>128</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="3456"/>
				<biases offset="3456" size="128"/>
			</blobs>
		</layer>
		<layer id="5" name="conv1_1_3x3_s2/conv1_1_3x3_s2" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv1_2_3x3/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3584" size="36864"/>
				<biases offset="40448" size="128"/>
			</blobs>
		</layer>
		<layer id="7" name="conv1_2_3x3/conv1_2_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="conv1_3_3x3/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="same_upper" dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
			<blobs>
				<weights offset="40576" size="73728"/>
				<biases offset="114304" size="256"/>
			</blobs>
		</layer>
		<layer id="9" name="conv1_3_3x3/conv1_3_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="pool1_3x3_s2" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" pool-method="max" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>64</dim>
					<dim>128</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="conv2_1_1x1_proj/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="114560" size="32768"/>
				<biases offset="147328" size="512"/>
			</blobs>
		</layer>
		<layer id="12" name="ResizeBilinear" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="conv2_1_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="147840" size="8192"/>
				<biases offset="156032" size="128"/>
			</blobs>
		</layer>
		<layer id="14" name="conv2_1_1x1_reduce/conv2_1_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="conv2_1_3x3/Conv2D" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="156160" size="36864"/>
				<biases offset="193024" size="128"/>
			</blobs>
		</layer>
		<layer id="16" name="conv2_1_3x3/conv2_1_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="conv2_1_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="193152" size="16384"/>
				<biases offset="209536" size="512"/>
			</blobs>
		</layer>
		<layer id="18" name="conv2_1/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="conv2_1/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="ResizeBilinear_1" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="conv2_2_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="210048" size="16384"/>
				<biases offset="226432" size="128"/>
			</blobs>
		</layer>
		<layer id="22" name="conv2_2_1x1_reduce/conv2_2_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="conv2_2_3x3/Conv2D" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="226560" size="36864"/>
				<biases offset="263424" size="128"/>
			</blobs>
		</layer>
		<layer id="24" name="conv2_2_3x3/conv2_2_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="conv2_2_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="263552" size="16384"/>
				<biases offset="279936" size="512"/>
			</blobs>
		</layer>
		<layer id="26" name="conv2_2/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="conv2_2/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="ResizeBilinear_2" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="conv2_3_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="32" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="280448" size="16384"/>
				<biases offset="296832" size="128"/>
			</blobs>
		</layer>
		<layer id="30" name="conv2_3_1x1_reduce/conv2_3_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="conv2_3_3x3/Conv2D" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="32" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="296960" size="36864"/>
				<biases offset="333824" size="128"/>
			</blobs>
		</layer>
		<layer id="32" name="conv2_3_3x3/conv2_3_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="conv2_3_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="333952" size="16384"/>
				<biases offset="350336" size="512"/>
			</blobs>
		</layer>
		<layer id="34" name="conv2_3/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="conv2_3/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="conv3_1_1x1_proj/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="350848" size="131072"/>
				<biases offset="481920" size="1024"/>
			</blobs>
		</layer>
		<layer id="37" name="ResizeBilinear_3" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="conv3_1_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>32</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="482944" size="32768"/>
				<biases offset="515712" size="256"/>
			</blobs>
		</layer>
		<layer id="39" name="conv3_1_1x1_reduce/conv3_1_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="conv3_1_3x3/Conv2D" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="515968" size="147456"/>
				<biases offset="663424" size="256"/>
			</blobs>
		</layer>
		<layer id="41" name="conv3_1_3x3/conv3_1_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="conv3_1_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="663680" size="65536"/>
				<biases offset="729216" size="1024"/>
			</blobs>
		</layer>
		<layer id="43" name="conv3_1/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="conv3_1/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="conv3_1_sub4" precision="FP32" type="Interp">
			<data align_corners="1" factor="0.5" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>16</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="ResizeBilinear_4" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="conv3_2_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="730240" size="65536"/>
				<biases offset="795776" size="256"/>
			</blobs>
		</layer>
		<layer id="48" name="conv3_2_1x1_reduce/conv3_2_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="conv3_2_3x3/Conv2D" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="796032" size="147456"/>
				<biases offset="943488" size="256"/>
			</blobs>
		</layer>
		<layer id="50" name="conv3_2_3x3/conv3_2_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="conv3_2_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="943744" size="65536"/>
				<biases offset="1009280" size="1024"/>
			</blobs>
		</layer>
		<layer id="52" name="conv3_2/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="conv3_2/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="ResizeBilinear_5" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="conv3_3_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1010304" size="65536"/>
				<biases offset="1075840" size="256"/>
			</blobs>
		</layer>
		<layer id="56" name="conv3_3_1x1_reduce/conv3_3_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="conv3_3_3x3/Conv2D" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1076096" size="147456"/>
				<biases offset="1223552" size="256"/>
			</blobs>
		</layer>
		<layer id="58" name="conv3_3_3x3/conv3_3_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="conv3_3_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1223808" size="65536"/>
				<biases offset="1289344" size="1024"/>
			</blobs>
		</layer>
		<layer id="60" name="conv3_3/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="conv3_3/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="ResizeBilinear_6" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="conv3_4_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="64" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1290368" size="65536"/>
				<biases offset="1355904" size="256"/>
			</blobs>
		</layer>
		<layer id="64" name="conv3_4_1x1_reduce/conv3_4_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="conv3_4_3x3/Conv2D" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="64" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1356160" size="147456"/>
				<biases offset="1503616" size="256"/>
			</blobs>
		</layer>
		<layer id="66" name="conv3_4_3x3/conv3_4_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="conv3_4_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="256" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1503872" size="65536"/>
				<biases offset="1569408" size="1024"/>
			</blobs>
		</layer>
		<layer id="68" name="conv3_4/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="conv3_4/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="conv4_1_1x1_proj/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1570432" size="524288"/>
				<biases offset="2094720" size="2048"/>
			</blobs>
		</layer>
		<layer id="71" name="ResizeBilinear_7" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="conv4_1_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>256</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2096768" size="131072"/>
				<biases offset="2227840" size="512"/>
			</blobs>
		</layer>
		<layer id="73" name="conv4_1_1x1_reduce/conv4_1_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="conv4_1_3x3/convolution" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2228352" size="589824"/>
				<biases offset="2818176" size="512"/>
			</blobs>
		</layer>
		<layer id="75" name="conv4_1_3x3/conv4_1_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="conv4_1_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2818688" size="262144"/>
				<biases offset="3080832" size="2048"/>
			</blobs>
		</layer>
		<layer id="77" name="conv4_1/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="conv4_1/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="ResizeBilinear_8" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="conv4_2_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3082880" size="262144"/>
				<biases offset="3345024" size="512"/>
			</blobs>
		</layer>
		<layer id="81" name="conv4_2_1x1_reduce/conv4_2_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="conv4_2_3x3/convolution" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3345536" size="589824"/>
				<biases offset="3935360" size="512"/>
			</blobs>
		</layer>
		<layer id="83" name="conv4_2_3x3/conv4_2_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="conv4_2_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3935872" size="262144"/>
				<biases offset="4198016" size="2048"/>
			</blobs>
		</layer>
		<layer id="85" name="conv4_2/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="conv4_2/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="ResizeBilinear_9" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="conv4_3_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4200064" size="262144"/>
				<biases offset="4462208" size="512"/>
			</blobs>
		</layer>
		<layer id="89" name="conv4_3_1x1_reduce/conv4_3_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="conv4_3_3x3/convolution" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4462720" size="589824"/>
				<biases offset="5052544" size="512"/>
			</blobs>
		</layer>
		<layer id="91" name="conv4_3_3x3/conv4_3_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="conv4_3_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5053056" size="262144"/>
				<biases offset="5315200" size="2048"/>
			</blobs>
		</layer>
		<layer id="93" name="conv4_3/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="conv4_3/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="ResizeBilinear_10" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="conv4_4_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5317248" size="262144"/>
				<biases offset="5579392" size="512"/>
			</blobs>
		</layer>
		<layer id="97" name="conv4_4_1x1_reduce/conv4_4_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="conv4_4_3x3/convolution" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5579904" size="589824"/>
				<biases offset="6169728" size="512"/>
			</blobs>
		</layer>
		<layer id="99" name="conv4_4_3x3/conv4_4_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="conv4_4_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6170240" size="262144"/>
				<biases offset="6432384" size="2048"/>
			</blobs>
		</layer>
		<layer id="101" name="conv4_4/sum_1" precision="FP32" type="Eltwise">
			<data operation="sum"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="2">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="conv4_4/relu" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="ResizeBilinear_11" precision="FP32" type="Interp">
			<data align_corners="0" factor="1.0" pad_beg="0" pad_end="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="conv4_5_1x1_reduce/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="128" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>512</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6434432" size="262144"/>
				<biases offset="6696576" size="512"/>
			</blobs>
		</layer>
		<layer id="105" name="conv4_5_1x1_reduce/conv4_5_1x1_reduce" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="conv4_5_3x3/convolution" precision="FP32" type="Convolution">
			<data dilations="2,2" group="1" kernel="3,3" output="128" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6697088" size="589824"/>
				<biases offset="7286912" size="512"/>
			</blobs>
		</layer>
		<layer id="107" name="conv4_5_3x3/conv4_5_3x3" precision="FP32" type="ReLU">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="conv4_5_1x1_increase/Conv2D" precision="FP32" type="Convolution">
			<data auto_pad="valid" dilations="1,1" group="1" kernel="1,1" output="512" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>8</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>512</dim>
